In [1]:
!pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in c:\programdata\anaconda3\lib\site-packages (1.4.2)
Requirement already satisfied: pytz>=2020.1 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2021.3)
Requirement already satisfied: numpy>=1.18.5 in c:\programdata\anaconda3\lib\site-packages (from pandas) (1.21.5)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: six>=1.5 in c:\programdata\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [7]:
import pandas as pd

In [8]:
sal_l=[1500.0,2000.0,2200.0]

In [9]:
pd.Series?

In [11]:
sal_s=pd.Series(sal_l,name='sal')

In [12]:
sal_s

0    1500.0
1    2000.0
2    2200.0
Name: sal, dtype: float64

In [17]:
sal_s[:2:2]

0    1500.0
Name: sal, dtype: float64

In [18]:
sal_id=[(1,1500.0),(2,2000.0),(3,2200)]

In [19]:
sal_id

[(1, 1500.0), (2, 2000.0), (3, 2200)]

In [21]:
sal_df=pd.DataFrame(sal_id,columns=['id','sal'])

In [22]:
sal_df

   id     sal
0   1  1500.0
1   2  2000.0
2   3  2200.0

In [23]:
sal_df['id']

0    1
1    2
2    3
Name: id, dtype: int64

In [24]:
##overview series

In [25]:
d={"Jan":10, "Feb":15,"March":12,"April":16}

In [27]:
type(d)

dict

In [26]:
d

{'Jan': 10, 'Feb': 15, 'March': 12, 'April': 16}

In [33]:
import pandas as pd
s=pd.Series(d,name='value')

In [37]:
s['Jan']

10

In [38]:
s[0]

10

In [42]:
s[0:]

Jan      10
Feb      15
March    12
April    16
Name: value, dtype: int64

In [45]:
s.sum()

53

In [46]:
l=[10,15,12,16]

In [50]:
l_s=pd.Series(l)
l_s

0    10
1    15
2    12
3    16
dtype: int64

In [51]:
l_s[0]

10

In [ ]:
#craeting DataFrame

In [53]:
import pandas as pd

In [60]:
sal_id=[(1,1500.0),(2,2000.0,10.0),(3,2200.00)]
sal_id

[(1, 1500.0), (2, 2000.0, 10.0), (3, 2200.0)]

In [61]:
sal_df=pd.DataFrame(sal_id)
sal_df

   0       1     2
0  1  1500.0   NaN
1  2  2000.0  10.0
2  3  2200.0   NaN

In [63]:
sal_df=pd.DataFrame(sal_id,columns=['id','sal','comm'])
sal_df

   id     sal  comm
0   1  1500.0   NaN
1   2  2000.0  10.0
2   3  2200.0   NaN

In [69]:
sal_id[0]

0    1500.0
1    2000.0
2    2200.0
Name: sal, dtype: float64

In [70]:
sal_df['id']

0    1
1    2
2    3
Name: id, dtype: int64

In [71]:
sal_df['sal']

0    1500.0
1    2000.0
2    2200.0
Name: sal, dtype: float64

In [75]:
sal_df[['id','sal','comm']]

   id     sal  comm
0   1  1500.0   NaN
1   2  2000.0  10.0
2   3  2200.0   NaN

In [ ]:
#creating dataframe using list of dict

In [84]:
sal_ld=[
        {'id':1,'sal':1500.0},
        {'id':2,'sal':2000.0,'comm':10.0},
        {'id':3,'sal':2200.0,'active':False}
       ]
sal_ld

[{'id': 1, 'sal': 1500.0},
 {'id': 2, 'sal': 2000.0, 'comm': 10.0},
 {'id': 3, 'sal': 2200.0, 'active': False}]

In [85]:
sals_df=pd.DataFrame(sal_ld)
sals_df

   id     sal  comm active
0   1  1500.0   NaN    NaN
1   2  2000.0  10.0    NaN
2   3  2200.0   NaN  False

In [99]:
sals_df[['id','sal']]

   id     sal
0   1  1500.0
1   2  2000.0
2   3  2200.0

In [98]:
sals_df.shape

(3, 4)

In [97]:
sals_df.shape[0]

3

In [101]:
sals_df.count()[::-1]

active    1
comm      1
sal       3
id        3
dtype: int64

In [102]:
sals_df.count()

id        3
sal       3
comm      1
active    1
dtype: int64

In [107]:
sals_df.dtypes

id          int64
sal       float64
comm      float64
active     object
dtype: object

In [109]:
sals_df

   id     sal  comm active
0   1  1500.0   NaN    NaN
1   2  2000.0  10.0    NaN
2   3  2200.0   NaN  False

In [110]:
sals_df.fillna(0.0)

   id     sal  comm active
0   1  1500.0   0.0    0.0
1   2  2000.0  10.0    0.0
2   3  2200.0   0.0  False

In [111]:
sals_df.fillna({'comm':0.0})

   id     sal  comm active
0   1  1500.0   0.0    NaN
1   2  2000.0  10.0    NaN
2   3  2200.0   0.0  False

In [112]:
sals_df.fillna({'comm':0.0,'active':True})

   id     sal  comm  active
0   1  1500.0   0.0    True
1   2  2000.0  10.0    True
2   3  2200.0   0.0   False

In [133]:
sals_df.drop?# drop both rows and column ,Axis=0 means try to delete rows by default for column Axis=1

In [149]:
sals_df.drop(columns=['id','sal'])

   comm active
0   NaN    NaN
1  10.0    NaN
2   NaN  False

In [150]:
sals_df.columns

Index(['id', 'sal', 'comm', 'active'], dtype='object')

In [153]:
sals_df.columns=['emp_id','sall','commm','ac'] # reanme the columns
sals_df.columns

Index(['emp_id', 'sall', 'commm', 'ac'], dtype='object')

In [156]:
sals_df.sort_index()# by default ascending if ascending=false means descending

   emp_id    sall  commm     ac
0       1  1500.0    NaN    NaN
1       2  2000.0   10.0    NaN
2       3  2200.0    NaN  False

In [160]:
sals_df.sort_values?   #(by='emp_id',ascending=False)

SyntaxError: invalid syntax (2916524065.py, line 1)

In [163]:
sals_df.sort_values(by='emp_id',ascending=False)

   emp_id    sall  commm     ac
2       3  2200.0    NaN  False
1       2  2000.0   10.0    NaN
0       1  1500.0    NaN    NaN

In [172]:
sals_ld =[
      {'id':1, 'sal':1500.0},
      {'id':2, 'sal':2000.0,'comm': 10.0},
      {'id':3, 'sal': 2200.0 ,'active': False},
      {'id':4, 'sal': 2000.0}

         ]

In [174]:
d=pd.DataFrame(sals_ld)
d

   id     sal  comm active
0   1  1500.0   NaN    NaN
1   2  2000.0  10.0    NaN
2   3  2200.0   NaN  False
3   4  2000.0   NaN    NaN

In [177]:
sort_=d.sort_values(by=['sal','id'],ascending=[False,True])
sort_

   id     sal  comm active
2   3  2200.0   NaN  False
1   2  2000.0  10.0    NaN
3   4  2000.0   NaN    NaN
0   1  1500.0   NaN    NaN

In [4]:
import pandas as pd

In [5]:
dataframe_1 = pd.DataFrame({"Common": ["A", "B", "C", "D", "E"],
   "Name": ["John", "Alice", "Emma", "Watson", "Harry"], "Age": [18, 19, 20, 21, 15]})
dataframe_1

  Common    Name  Age
0      A    John   18
1      B   Alice   19
2      C    Emma   20
3      D  Watson   21
4      E   Harry   15

In [6]:
dataframe_2 =pd.DataFrame({"Common": ["A", "B", "C", "D", "E"], 
                           "Sport": ["Cricket", "Football", "TableTennis", "Badminton", "Chess"],
                           "Movie": ["Jumanji", "Black Widow", "End Game", "Mr. Robot",  "Matrix"]})
dataframe_2

  Common        Sport        Movie
0      A      Cricket      Jumanji
1      B     Football  Black Widow
2      C  TableTennis     End Game
3      D    Badminton    Mr. Robot
4      E        Chess       Matrix

In [9]:
new_df = pd.merge(dataframe_1, dataframe_2, how="inner", on="Common")
new_df

  Common    Name  Age        Sport        Movie
0      A    John   18      Cricket      Jumanji
1      B   Alice   19     Football  Black Widow
2      C    Emma   20  TableTennis     End Game
3      D  Watson   21    Badminton    Mr. Robot
4      E   Harry   15        Chess       Matrix